Repository: TomaszKrasienko/discipline
Catalog: discipline.centre/src/Modules/ActivityRules/discipline.centre.activityrules.api/Resources/ErrorMessages.*.resx
Languages: pl

# CreateActivityRule.NotUniqueTitle
source: Activity rule with 'Title': {0} already registered
pl: Reguła aktywności z Tytułem: {0} jest już zarejestrowana

# UpdateActivityRule.ActivityRuleNotFound
source: Activity rule with 'ID': {0} not found
pl: Nie znaleziono reguły aktywności z ID: {0}

# UpdateActivityRule.NotUniqueTitle
source: Activity rule with 'Title': {0} already registered
pl: Reguła aktywności z Tytułem: {0} jest już zarejestrowana

# CreateStageForActivityRule.ActivityRuleNotFound
source: Activity rule with 'ID': {0} not found
pl: Nie znaleziono reguły aktywności z ID: {0}

# Validation.EmptyActivityRuleTitle
source: Activity rule 'Title' cannot be empty
pl: 'Tytuł' reguły aktywności nie może być pusty

# Validation.ActivityRuleTitleTooLong
source: Activity rule 'Title' cannot exceed 30 characters
pl: 'Tytuł' reguły aktywności nie może przekraczać 30 znaków

# Validation.EmptyActivityRuleMode
source: Activity rule 'Mode' cannot be empty
pl: 'Typ' reguły aktywności nie może być pusty

# Validation.NullDetails
source: Activity rule 'Details' cannot be null
pl: Sekcja 'Details' nie może być pusta

# Validation.NullMode
source: Activity rule 'Mode cannot be null
pl: Sekcja 'Mode' nie może być pusta

# ActivityRule.Details.EmptyTitle
source: Activity rule 'Title' cannot be empty
pl: 'Tytuł' reguły aktywności nie może być pusty

# ActivityRule.Details.TitleTooLong
source: Activity rule 'Title' cannot exceed 30 characters
pl: 'Tytuł' reguły aktywności nie może przekraczać 30 znaków

# ActivityRules.Mode.RuleModeRequireSelectedDays
source: Activity rule mode require selected days
pl: Wybrany typ reguły aktywności wymaga wybrania dni

# ActivityRule.Mode.SelectedDayOutOfRange
source: At least one activity rule selected day is out of range
pl: Conajmniej jeden z wybranych dni reguły aktywności jest poza zakresem

# ActivityRule.Stage.Title.EmptyValue
source: Activity rule stage 'Title' cannot be empty
pl: 'Tytuł' etapu reguły aktywności nie może być pusty

# ActivityRule.Stage.Title.ValueTooLong
source: Activity rule stage 'Title' cannot exceed 30 characters
pl: 'Tytuł' etapu reguły aktywności nie może przekraczać 30 znaków

# ActivityRule.Stage.Index.ValueBelowOne
source: Activity rule stage 'OrderIndex' value must be positive
pl: Indeks reguły aktywności nie musi być równy lub większy jeden

# ActivityRule.Stages.StageTitleMustBeUnique
source: Activity rule stage 'Title' must be unique
pl: 'Tytuł' etapu reguły aktywności musi być unikalny

# ActivityRules.Mode.RuleModeSelectedDayOutOfRange
source: Activity rule selected day with number: {0} is out of range
pl: Wybrany numer dnia: {0} dla reguły aktywności wychodzi poza zakres
